package com.geely.design.pattern.structural.adapter;
/**
 适配器模式
 一、定义
    将一个类的接口（被适配者）转换成客户期望的另一个类的接口（目标类）
    使原本接口不兼容的类可以一起工作

 二、适用场景
    已存在的类，它的方法和需求不匹配时（方法结果相同或相似）
    不是软件设计阶段考虑的设计模式，
    是随着软件维护，由于不同产品、不同厂家造成功能类似而接口不相同的情况下的解决方案

 三、优点
    能提高类的透明性和复用，现有的类复用但不需要改变
    目标类和适配器类解耦，提高程序扩展性

 四、缺点
    适配器编写过程需要全面考虑，可能会增加系统的复杂性
    增加系统代码可读的难度

 五、扩展
    对象适配器模式：通过继承
    类适配器：通过组合
    继承和组合时优先选择组合

    1、适配器模式和外观模式
        都是对现存现有的类现，存系统进行封装，
        外观模式定义了新的接口，在现有的系统中提供一个更为方便的访问入口
        适配器模式复用原有的接口，使得2个已有的接口协同工作

 */